---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StairsRun Properties
StairsRun Class See Also Send Feedback
---

The StairsRun type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ActualRisersNumber | The actual number of stairs risers in the stairs run. |
|  | ActualRunWidth | Specifies the value of the tread width excluding the width of independent side supports. |
|  | ActualTreadsNumber | The actual number of stairs treads in the stairs run. |
|  | AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
|  | BaseElevation | The base elevation of the stairs run. |
|  | BeginsWithRiser | True if the stairs run begins with a riser, false otherwise. |
|  | BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
|  | Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
|  | CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
|  | DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
|  | DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
|  | Document | Returns the Document in which the Element resides. (Inherited from Element.) |
|  | EndsWithRiser | True if the stairs run ends with a riser, false otherwise. |
|  | ExtensionBelowRiserBase | Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a riser. |
|  | ExtensionBelowTreadBase | Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a tread. |
|  | Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
|  | GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
|  | Height | The calculated height of the stairs run. |
|  | Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
|  | IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
|  | IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
|  | LevelId | The id of the level associated with the element.  (Inherited from Element.) |
|  | Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
|  | LocationLineJustification | The position of the run relative to the Up-direction path used to create the run. |
|  | Name | A human readable name for the Element. (Inherited from Element.) |
|  | OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
|  | [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md) | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
|  | [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md) | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
|  | [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md) | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
|  | Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
|  | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
|  | Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
|  | StairsRunStyle | The style of the stairs run such as straight, winder, etc. |
|  | TopElevation | The top elevation of the stairs run. |
|  | UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
|  | VersionGuid | Get the element version Guid.  (Inherited from Element.) |
|  | ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
|  | WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace